Masmiseim36/nxpSDK/boards/evkmcimx7ulp/multicore_examples/rpmsg_lite_str_echo_rtos/pin_mux.h
/* PTB7 (number AF6), BT_HOST_WAKE */
#define BOARD_BT_HOST_WAKE_PERIPHERAL                                        PTB   /*!< Device name: PTB */
#define BOARD_BT_HOST_WAKE_SIGNAL                                           port   /*!< PTB signal: port */
#define BOARD_BT_HOST_WAKE_CHANNEL                                             7   /*!< PTB port channel: 7 */
#define BOARD_BT_HOST_WAKE_PIN_NAME                                         PTB7   /*!< Pin name */
#define BOARD_BT_HOST_WAKE_PIN_FUNCTION_ID                      IOMUXC_PTB7_PTB7   /*!< Pin function id */
#define BOARD_BT_HOST_WAKE_LABEL                                  "BT_HOST_WAKE"   /*!< Label */
#define BOARD_BT_HOST_WAKE_NAME                                   "BT_HOST_WAKE"   /*!< Identifier name */

/* PTB9 (number AD7), SEN_INT# */
#define BOARD_SEN_INT_PERIPHERAL                                             PTB   /*!< Device name: PTB */
#define BOARD_SEN_INT_SIGNAL                                                port   /*!< PTB signal: port */
#define BOARD_SEN_INT_CHANNEL                                                  9   /*!< PTB port channel: 9 */
#define BOARD_SEN_INT_PIN_NAME                                              PTB9   /*!< Pin name */
#define BOARD_SEN_INT_PIN_FUNCTION_ID                           IOMUXC_PTB9_PTB9   /*!< Pin function id */
#define BOARD_SEN_INT_LABEL                                           "SEN_INT#"   /*!< Label */
#define BOARD_SEN_INT_NAME                                             "SEN_INT"   /*!< Identifier name */

/* PTB11 (number AB7), PMIC_INT# */
#define BOARD_PMIC_INT_PERIPHERAL                                            PTB   /*!< Device name: PTB */
#define BOARD_PMIC_INT_SIGNAL                                               port   /*!< PTB signal: port */
#define BOARD_PMIC_INT_CHANNEL                                                11   /*!< PTB port channel: 11 */
#define BOARD_PMIC_INT_PIN_NAME                                            PTB11   /*!< Pin name */
#define BOARD_PMIC_INT_PIN_FUNCTION_ID                        IOMUXC_PTB11_PTB11   /*!< Pin function id */
#define BOARD_PMIC_INT_LABEL                                         "PMIC_INT#"   /*!< Label */
#define BOARD_PMIC_INT_NAME                                           "PMIC_INT"   /*!< Identifier name */

/* PTB14 (number AG8), RTC_CLK */
#define BOARD_RTC_CLK_PERIPHERAL                                             RTC   /*!< Device name: RTC */
#define BOARD_RTC_CLK_SIGNAL                                          rtc_clkout   /*!< RTC signal: rtc_clkout */
#define BOARD_RTC_CLK_PIN_NAME                                             PTB14   /*!< Pin name */
#define BOARD_RTC_CLK_PIN_FUNCTION_ID                    IOMUXC_PTB14_RTC_CLKOUT   /*!< Pin function id */
#define BOARD_RTC_CLK_LABEL                                            "RTC_CLK"   /*!< Label */
#define BOARD_RTC_CLK_NAME                                             "RTC_CLK"   /*!< Identifier name */

/* PTA16 (number AG18), I2C0_SCL */
#define BOARD_I2C0_SCL_PERIPHERAL                                         LPI2C0   /*!< Device name: LPI2C0 */
#define BOARD_I2C0_SCL_SIGNAL                                          lpi2c_scl   /*!< LPI2C0 signal: lpi2c_scl */
#define BOARD_I2C0_SCL_PIN_NAME                                            PTA16   /*!< Pin name */
#define BOARD_I2C0_SCL_PIN_FUNCTION_ID                   IOMUXC_PTA16_LPI2C0_SCL   /*!< Pin function id */
#define BOARD_I2C0_SCL_LABEL                                          "I2C0_SCL"   /*!< Label */
#define BOARD_I2C0_SCL_NAME                                           "I2C0_SCL"   /*!< Identifier name */

/* PTA17 (number AD19), I2C0_SDA */
#define BOARD_I2C0_SDA_PERIPHERAL                                         LPI2C0   /*!< Device name: LPI2C0 */
#define BOARD_I2C0_SDA_SIGNAL                                          lpi2c_sda   /*!< LPI2C0 signal: lpi2c_sda */
#define BOARD_I2C0_SDA_PIN_NAME                                            PTA17   /*!< Pin name */
#define BOARD_I2C0_SDA_PIN_FUNCTION_ID                   IOMUXC_PTA17_LPI2C0_SDA   /*!< Pin function id */
#define BOARD_I2C0_SDA_LABEL                                          "I2C0_SDA"   /*!< Label */
#define BOARD_I2C0_SDA_NAME                                           "I2C0_SDA"   /*!< Identifier name */

/* PTB12 (number AC8), I2C3_SCL */
#define BOARD_I2C3_SCL_PERIPHERAL                                         LPI2C3   /*!< Device name: LPI2C3 */
#define BOARD_I2C3_SCL_SIGNAL                                          lpi2c_scl   /*!< LPI2C3 signal: lpi2c_scl */
#define BOARD_I2C3_SCL_PIN_NAME                                            PTB12   /*!< Pin name */
#define BOARD_I2C3_SCL_PIN_FUNCTION_ID                   IOMUXC_PTB12_LPI2C3_SCL   /*!< Pin function id */
#define BOARD_I2C3_SCL_LABEL                                          "I2C3_SCL"   /*!< Label */
#define BOARD_I2C3_SCL_NAME                                           "I2C3_SCL"   /*!< Identifier name */

/* PTB13 (number AD8), I2C3_SDA */
#define BOARD_I2C3_SDA_PERIPHERAL                                         LPI2C3   /*!< Device name: LPI2C3 */
#define BOARD_I2C3_SDA_SIGNAL                                          lpi2c_sda   /*!< LPI2C3 signal: lpi2c_sda */
#define BOARD_I2C3_SDA_PIN_NAME                                            PTB13   /*!< Pin name */
#define BOARD_I2C3_SDA_PIN_FUNCTION_ID                   IOMUXC_PTB13_LPI2C3_SDA   /*!< Pin function id */
#define BOARD_I2C3_SDA_LABEL                                          "I2C3_SDA"   /*!< Label */
#define BOARD_I2C3_SDA_NAME                                           "I2C3_SDA"   /*!< Identifier name */

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif


/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins_Core1(void);                           /*!< Function assigned for the core: Cortex-M4[cm4] */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_I2C_ConfigurePins(void);                        /*!< Function assigned for the core: Cortex-M4[cm4] */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
